zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257cxx_cm0.h
/******************  Bit definition for DMA_CTR2 register  *******************/
#define DMA_CTR2_REQSEL_Pos     (0U)
#define DMA_CTR2_REQSEL_Msk     (0xFFUL << DMA_CTR2_REQSEL_Pos)             /*!< 0x000000FF */
#define DMA_CTR2_REQSEL         DMA_CTR2_REQSEL_Msk                        /*!< DMA hardware request selection */
#define DMA_CTR2_SWREQ_Pos      (9U)
#define DMA_CTR2_SWREQ_Msk      (0x1UL << DMA_CTR2_SWREQ_Pos)               /*!< 0x00000200 */
#define DMA_CTR2_SWREQ          DMA_CTR2_SWREQ_Msk                         /*!< Software request */
#define DMA_CTR2_DREQ_Pos       (10U)
#define DMA_CTR2_DREQ_Msk       (0x1UL << DMA_CTR2_DREQ_Pos)                /*!< 0x00000400 */
#define DMA_CTR2_DREQ           DMA_CTR2_DREQ_Msk                          /*!< Destination hardware request */
#define DMA_CTR2_BREQ_Pos       (11U)
#define DMA_CTR2_BREQ_Msk       (0x1UL << DMA_CTR2_BREQ_Pos)                /*!< 0x00000800 */
#define DMA_CTR2_BREQ           DMA_CTR2_BREQ_Msk                          /*!< Block hardware request */
#define DMA_CTR2_PFREQ_Pos      (12U)
#define DMA_CTR2_PFREQ_Msk      (0x1UL << DMA_CTR2_PFREQ_Pos)               /*!< 0x00001000 */
#define DMA_CTR2_PFREQ          DMA_CTR2_PFREQ_Msk                         /*!< Hardware request in peripheral flow control mode */
#define DMA_CTR2_TRIGM_Pos      (14U)
#define DMA_CTR2_TRIGM_Msk      (0x3UL << DMA_CTR2_TRIGM_Pos)               /*!< 0x0000C000 */
#define DMA_CTR2_TRIGM          DMA_CTR2_TRIGM_Msk                         /*!< Trigger mode */
#define DMA_CTR2_TRIGM_0        (0x1UL << DMA_CTR2_TRIGM_Pos)               /*!< Bit 0 */
#define DMA_CTR2_TRIGM_1        (0x2UL << DMA_CTR2_TRIGM_Pos)               /*!< Bit 1 */
#define DMA_CTR2_TRIGSEL_Pos    (16U)
#define DMA_CTR2_TRIGSEL_Msk    (0x7FUL << DMA_CTR2_TRIGSEL_Pos)            /*!< 0x007F0000 */
#define DMA_CTR2_TRIGSEL        DMA_CTR2_TRIGSEL_Msk                       /*!< Trigger event input selection */
#define DMA_CTR2_TRIGPOL_Pos    (24U)
#define DMA_CTR2_TRIGPOL_Msk    (0x3UL << DMA_CTR2_TRIGPOL_Pos)             /*!< 0x03000000 */
#define DMA_CTR2_TRIGPOL        DMA_CTR2_TRIGPOL_Msk                       /*!< Trigger event polarity */
#define DMA_CTR2_TRIGPOL_0      (0x1UL << DMA_CTR2_TRIGPOL_Pos)             /*!< Bit 0 */
#define DMA_CTR2_TRIGPOL_1      (0x2UL << DMA_CTR2_TRIGPOL_Pos)             /*!< Bit 1 */
#define DMA_CTR2_TCEM_Pos       (30U)
#define DMA_CTR2_TCEM_Msk       (0x3UL << DMA_CTR2_TCEM_Pos)                /*!< 0xC0000000 */
#define DMA_CTR2_TCEM           DMA_CTR2_TCEM_Msk                          /*!< Transfer complete event mode */
#define DMA_CTR2_TCEM_0         (0x1UL << DMA_CTR2_TCEM_Pos)                /*!< Bit 0 */
#define DMA_CTR2_TCEM_1         (0x2UL << DMA_CTR2_TCEM_Pos)                /*!< Bit 1 */

/******************  Bit definition for DMA_CBR1 register  *******************/
#define DMA_CBR1_BNDT_Pos      (0U)
#define DMA_CBR1_BNDT_Msk      (0xFFFFUL << DMA_CBR1_BNDT_Pos)              /*!< 0x0000FFFF */
#define DMA_CBR1_BNDT          DMA_CBR1_BNDT_Msk                           /*!< Block number of data bytes to transfer from the source */
#define DMA_CBR1_BRC_Pos       (16U)
#define DMA_CBR1_BRC_Msk       (0x7FFUL << DMA_CBR1_BRC_Pos)               /*!< 0x07FF0000 */
#define DMA_CBR1_BRC           DMA_CBR1_BRC_Msk                            /*!< Block repeat counter */
#define DMA_CBR1_SDEC_Pos      (28U)
#define DMA_CBR1_SDEC_Msk      (0x1UL << DMA_CBR1_SDEC_Pos)                 /*!< 0x10000000 */
#define DMA_CBR1_SDEC          DMA_CBR1_SDEC_Msk                           /*!< Source address decrement */
#define DMA_CBR1_DDEC_Pos      (29U)
#define DMA_CBR1_DDEC_Msk      (0x1UL << DMA_CBR1_DDEC_Pos)                 /*!< 0x20000000 */
#define DMA_CBR1_DDEC          DMA_CBR1_DDEC_Msk                           /*!< Destination address decrement */
#define DMA_CBR1_BRSDEC_Pos    (30U)
#define DMA_CBR1_BRSDEC_Msk    (0x1UL << DMA_CBR1_BRSDEC_Pos)               /*!< 0x40000000 */
#define DMA_CBR1_BRSDEC        DMA_CBR1_BRSDEC_Msk                         /*!< Block repeat source address decrement */
#define DMA_CBR1_BRDDEC_Pos    (31U)
#define DMA_CBR1_BRDDEC_Msk    (0x1UL << DMA_CBR1_BRDDEC_Pos)               /*!< 0x80000000 */
#define DMA_CBR1_BRDDEC        DMA_CBR1_BRDDEC_Msk                         /*!< Block repeat destination address decrement */

/******************  Bit definition for DMA_CSAR register  ********************/
#define DMA_CSAR_SA_Pos        (0U)
#define DMA_CSAR_SA_Msk        (0xFFFFFFFFUL << DMA_CSAR_SA_Pos)            /*!< 0xFFFFFFFF */
#define DMA_CSAR_SA            DMA_CSAR_SA_Msk                             /*!< Source Address */

/******************  Bit definition for DMA_CDAR register  *******************/
#define DMA_CDAR_DA_Pos        (0U)
#define DMA_CDAR_DA_Msk        (0xFFFFFFFFUL << DMA_CDAR_DA_Pos)             /*!< 0xFFFFFFFF */
#define DMA_CDAR_DA            DMA_CDAR_DA_Msk                              /*!< Destination address */

/******************  Bit definition for DMA_CTR3 register  *******************/
#define DMA_CTR3_SAO_Pos       (0U)
#define DMA_CTR3_SAO_Msk       (0x1FFFUL << DMA_CTR3_SAO_Pos)               /*!< 0x00001FFF */
#define DMA_CTR3_SAO           DMA_CTR3_SAO_Msk                            /*!< Source address offset increment */
#define DMA_CTR3_DAO_Pos       (16U)
#define DMA_CTR3_DAO_Msk       (0x1FFFUL << DMA_CTR3_DAO_Pos)               /*!< 0x1FFF0000 */
#define DMA_CTR3_DAO           DMA_CTR3_DAO_Msk                            /*!< Destination address offset increment */

/******************  Bit definition for DMA_CBR2 register  *******************/
#define DMA_CBR2_BRSAO_Pos     (0U)
#define DMA_CBR2_BRSAO_Msk     (0xFFFFUL << DMA_CBR2_BRSAO_Pos)             /*!< 0x0000FFFF */
#define DMA_CBR2_BRSAO         DMA_CBR2_BRSAO_Msk                          /*!< Block repeated source address offset */
#define DMA_CBR2_BRDAO_Pos     (16U)
#define DMA_CBR2_BRDAO_Msk     (0xFFFFUL << DMA_CBR2_BRDAO_Pos)             /*!< 0xFFFF0000 */
#define DMA_CBR2_BRDAO         DMA_CBR2_BRDAO_Msk                          /*!< Block repeated destination address offset */

/******************  Bit definition for DMA_CLLR register  *******************/
#define DMA_CLLR_LA_Pos        (2U)
#define DMA_CLLR_LA_Msk        (0x3FFFUL << DMA_CLLR_LA_Pos)                /*!< 0x0000FFFC */
#define DMA_CLLR_LA            DMA_CLLR_LA_Msk                             /*!< Pointer to the next linked-list data structure */
#define DMA_CLLR_ULL_Pos       (16U)
#define DMA_CLLR_ULL_Msk       (0x1UL << DMA_CLLR_ULL_Pos)                  /*!< 0x00010000 */
#define DMA_CLLR_ULL           DMA_CLLR_ULL_Msk                            /*!< Update link address register from memory */
#define DMA_CLLR_UB2_Pos       (25U)
#define DMA_CLLR_UB2_Msk       (0x1UL << DMA_CLLR_UB2_Pos)                  /*!< 0x02000000 */
#define DMA_CLLR_UB2           DMA_CLLR_UB2_Msk                            /*!< Update block register 2 from memory */
#define DMA_CLLR_UT3_Pos       (26U)
#define DMA_CLLR_UT3_Msk       (0x1UL << DMA_CLLR_UT3_Pos)                  /*!< 0x04000000 */
#define DMA_CLLR_UT3           DMA_CLLR_UT3_Msk                            /*!< Update transfer register 3 from SRAM */
#define DMA_CLLR_UDA_Pos       (27U)
#define DMA_CLLR_UDA_Msk       (0x1UL << DMA_CLLR_UDA_Pos)                  /*!< 0x08000000 */
#define DMA_CLLR_UDA           DMA_CLLR_UDA_Msk                            /*!< Update destination address register from SRAM */
#define DMA_CLLR_USA_Pos       (28U)
#define DMA_CLLR_USA_Msk       (0x1UL << DMA_CLLR_USA_Pos)                  /*!< 0x10000000 */
#define DMA_CLLR_USA           DMA_CLLR_USA_Msk                            /*!< Update source address register from SRAM */
#define DMA_CLLR_UB1_Pos       (29U)
#define DMA_CLLR_UB1_Msk       (0x1UL << DMA_CLLR_UB1_Pos)                  /*!< 0x20000000 */
#define DMA_CLLR_UB1           DMA_CLLR_UB1_Msk                            /*!< Update block register 1 from SRAM */
#define DMA_CLLR_UT2_Pos       (30U)
#define DMA_CLLR_UT2_Msk       (0x1UL << DMA_CLLR_UT2_Pos)                  /*!< 0x40000000 */
#define DMA_CLLR_UT2           DMA_CLLR_UT2_Msk                            /*!< Update transfer register 2 from SRAM */
#define DMA_CLLR_UT1_Pos       (31U)
#define DMA_CLLR_UT1_Msk       (0x1UL << DMA_CLLR_UT1_Pos)                  /*!< 0x80000000 */
#define DMA_CLLR_UT1           DMA_CLLR_UT1_Msk                            /*!< Update transfer register 1 from SRAM */

/******************************************************************************/
/*                                                                            */
/*                    External Interrupt/Event Controller                     */
/*                               EXTI1/EXTI2                                  */
/*                   c7amba_exti_v3-0_UserSpec_v3_0_0m.pdf                    */
/*                   register declared following documentation order          */
/******************************************************************************/

/******************  Bit definition for EXTI1_RTSR1 register  *******************/
#define EXTI1_RTSR1_RT0_Pos         (0U)
#define EXTI1_RTSR1_RT0_Msk         (0x1UL << EXTI1_RTSR1_RT0_Pos)                /*!< 0x00000001 */
#define EXTI1_RTSR1_RT0             EXTI1_RTSR1_RT0_Msk                          /*!< Rising trigger event configuration bit of line 0 */
#define EXTI1_RTSR1_RT1_Pos         (1U)
#define EXTI1_RTSR1_RT1_Msk         (0x1UL << EXTI1_RTSR1_RT1_Pos)                /*!< 0x00000002 */
#define EXTI1_RTSR1_RT1             EXTI1_RTSR1_RT1_Msk                          /*!< Rising trigger event configuration bit of line 1 */
#define EXTI1_RTSR1_RT2_Pos         (2U)
#define EXTI1_RTSR1_RT2_Msk         (0x1UL << EXTI1_RTSR1_RT2_Pos)                /*!< 0x00000004 */
#define EXTI1_RTSR1_RT2             EXTI1_RTSR1_RT2_Msk                          /*!< Rising trigger event configuration bit of line 2 */
#define EXTI1_RTSR1_RT3_Pos         (3U)
#define EXTI1_RTSR1_RT3_Msk         (0x1UL << EXTI1_RTSR1_RT3_Pos)                /*!< 0x00000008 */
#define EXTI1_RTSR1_RT3             EXTI1_RTSR1_RT3_Msk                          /*!< Rising trigger event configuration bit of line 3 */
#define EXTI1_RTSR1_RT4_Pos         (4U)
#define EXTI1_RTSR1_RT4_Msk         (0x1UL << EXTI1_RTSR1_RT4_Pos)                /*!< 0x00000010 */
#define EXTI1_RTSR1_RT4             EXTI1_RTSR1_RT4_Msk                          /*!< Rising trigger event configuration bit of line 4 */
#define EXTI1_RTSR1_RT5_Pos         (5U)
#define EXTI1_RTSR1_RT5_Msk         (0x1UL << EXTI1_RTSR1_RT5_Pos)                /*!< 0x00000020 */
#define EXTI1_RTSR1_RT5             EXTI1_RTSR1_RT5_Msk                          /*!< Rising trigger event configuration bit of line 5 */
#define EXTI1_RTSR1_RT6_Pos         (6U)
#define EXTI1_RTSR1_RT6_Msk         (0x1UL << EXTI1_RTSR1_RT6_Pos)                /*!< 0x00000040 */
#define EXTI1_RTSR1_RT6             EXTI1_RTSR1_RT6_Msk                          /*!< Rising trigger event configuration bit of line 6 */
#define EXTI1_RTSR1_RT7_Pos         (7U)
#define EXTI1_RTSR1_RT7_Msk         (0x1UL << EXTI1_RTSR1_RT7_Pos)                /*!< 0x00000080 */
#define EXTI1_RTSR1_RT7             EXTI1_RTSR1_RT7_Msk                          /*!< Rising trigger event configuration bit of line 7 */
#define EXTI1_RTSR1_RT8_Pos         (8U)
#define EXTI1_RTSR1_RT8_Msk         (0x1UL << EXTI1_RTSR1_RT8_Pos)                /*!< 0x00000100 */
#define EXTI1_RTSR1_RT8             EXTI1_RTSR1_RT8_Msk                          /*!< Rising trigger event configuration bit of line 8 */
#define EXTI1_RTSR1_RT9_Pos         (9U)
#define EXTI1_RTSR1_RT9_Msk         (0x1UL << EXTI1_RTSR1_RT9_Pos)                /*!< 0x00000200 */
#define EXTI1_RTSR1_RT9             EXTI1_RTSR1_RT9_Msk                          /*!< Rising trigger event configuration bit of line 9 */
#define EXTI1_RTSR1_RT10_Pos        (10U)
#define EXTI1_RTSR1_RT10_Msk        (0x1UL << EXTI1_RTSR1_RT10_Pos)               /*!< 0x00000400 */
#define EXTI1_RTSR1_RT10            EXTI1_RTSR1_RT10_Msk                         /*!< Rising trigger event configuration bit of line 10 */
#define EXTI1_RTSR1_RT11_Pos        (11U)
#define EXTI1_RTSR1_RT11_Msk        (0x1UL << EXTI1_RTSR1_RT11_Pos)               /*!< 0x00000800 */
#define EXTI1_RTSR1_RT11            EXTI1_RTSR1_RT11_Msk                         /*!< Rising trigger event configuration bit of line 11 */
#define EXTI1_RTSR1_RT12_Pos        (12U)
#define EXTI1_RTSR1_RT12_Msk        (0x1UL << EXTI1_RTSR1_RT12_Pos)               /*!< 0x00001000 */
#define EXTI1_RTSR1_RT12            EXTI1_RTSR1_RT12_Msk                         /*!< Rising trigger event configuration bit of line 12 */
#define EXTI1_RTSR1_RT13_Pos        (13U)
#define EXTI1_RTSR1_RT13_Msk        (0x1UL << EXTI1_RTSR1_RT13_Pos)               /*!< 0x00002000 */
#define EXTI1_RTSR1_RT13            EXTI1_RTSR1_RT13_Msk                         /*!< Rising trigger event configuration bit of line 13 */
#define EXTI1_RTSR1_RT14_Pos        (14U)
#define EXTI1_RTSR1_RT14_Msk        (0x1UL << EXTI1_RTSR1_RT14_Pos)               /*!< 0x00004000 */
#define EXTI1_RTSR1_RT14            EXTI1_RTSR1_RT14_Msk                         /*!< Rising trigger event configuration bit of line 14 */
#define EXTI1_RTSR1_RT15_Pos        (15U)
#define EXTI1_RTSR1_RT15_Msk        (0x1UL << EXTI1_RTSR1_RT15_Pos)               /*!< 0x00008000 */
#define EXTI1_RTSR1_RT15            EXTI1_RTSR1_RT15_Msk                         /*!< Rising trigger event configuration bit of line 15 */
#define EXTI1_RTSR1_RT16_Pos        (16U)
#define EXTI1_RTSR1_RT16_Msk        (0x1UL << EXTI1_RTSR1_RT16_Pos)               /*!< 0x00010000 */
#define EXTI1_RTSR1_RT16            EXTI1_RTSR1_RT16_Msk                         /*!< Rising trigger event configuration bit of line 16 */
#define EXTI1_RTSR1_RT17_Pos        (17U)
#define EXTI1_RTSR1_RT17_Msk        (0x1UL << EXTI1_RTSR1_RT17_Pos)               /*!< 0x00020000 */
#define EXTI1_RTSR1_RT17            EXTI1_RTSR1_RT17_Msk                         /*!< Rising trigger event configuration bit of line 17 */
#define EXTI1_RTSR1_RT18_Pos        (18U)
#define EXTI1_RTSR1_RT18_Msk        (0x1UL << EXTI1_RTSR1_RT18_Pos)               /*!< 0x00040000 */
#define EXTI1_RTSR1_RT18            EXTI1_RTSR1_RT18_Msk                         /*!< Rising trigger event configuration bit of line 18 */

/******************  Bit definition for EXTI1_FTSR1 register  *******************/
#define EXTI1_FTSR1_FT0_Pos         (0U)
#define EXTI1_FTSR1_FT0_Msk         (0x1UL << EXTI1_FTSR1_FT0_Pos)                /*!< 0x00000001 */
#define EXTI1_FTSR1_FT0             EXTI1_FTSR1_FT0_Msk                          /*!< Falling trigger event configuration bit of line 0 */
#define EXTI1_FTSR1_FT1_Pos         (1U)
#define EXTI1_FTSR1_FT1_Msk         (0x1UL << EXTI1_FTSR1_FT1_Pos)                /*!< 0x00000002 */
#define EXTI1_FTSR1_FT1             EXTI1_FTSR1_FT1_Msk                          /*!< Falling trigger event configuration bit of line 1 */
#define EXTI1_FTSR1_FT2_Pos         (2U)
#define EXTI1_FTSR1_FT2_Msk         (0x1UL << EXTI1_FTSR1_FT2_Pos)                /*!< 0x00000004 */
#define EXTI1_FTSR1_FT2             EXTI1_FTSR1_FT2_Msk                          /*!< Falling trigger event configuration bit of line 2 */
#define EXTI1_FTSR1_FT3_Pos         (3U)
#define EXTI1_FTSR1_FT3_Msk         (0x1UL << EXTI1_FTSR1_FT3_Pos)                /*!< 0x00000008 */
#define EXTI1_FTSR1_FT3             EXTI1_FTSR1_FT3_Msk                          /*!< Falling trigger event configuration bit of line 3 */
#define EXTI1_FTSR1_FT4_Pos         (4U)
#define EXTI1_FTSR1_FT4_Msk         (0x1UL << EXTI1_FTSR1_FT4_Pos)                /*!< 0x00000010 */
#define EXTI1_FTSR1_FT4             EXTI1_FTSR1_FT4_Msk                          /*!< Falling trigger event configuration bit of line 4 */
#define EXTI1_FTSR1_FT5_Pos         (5U)
#define EXTI1_FTSR1_FT5_Msk         (0x1UL << EXTI1_FTSR1_FT5_Pos)                /*!< 0x00000020 */
#define EXTI1_FTSR1_FT5             EXTI1_FTSR1_FT5_Msk                          /*!< Falling trigger event configuration bit of line 5 */
#define EXTI1_FTSR1_FT6_Pos         (6U)
#define EXTI1_FTSR1_FT6_Msk         (0x1UL << EXTI1_FTSR1_FT6_Pos)                /*!< 0x00000040 */
#define EXTI1_FTSR1_FT6             EXTI1_FTSR1_FT6_Msk                          /*!< Falling trigger event configuration bit of line 6 */
#define EXTI1_FTSR1_FT7_Pos         (7U)
#define EXTI1_FTSR1_FT7_Msk         (0x1UL << EXTI1_FTSR1_FT7_Pos)                /*!< 0x00000080 */
#define EXTI1_FTSR1_FT7             EXTI1_FTSR1_FT7_Msk                          /*!< Falling trigger event configuration bit of line 7 */
#define EXTI1_FTSR1_FT8_Pos         (8U)
#define EXTI1_FTSR1_FT8_Msk         (0x1UL << EXTI1_FTSR1_FT8_Pos)                /*!< 0x00000100 */
#define EXTI1_FTSR1_FT8             EXTI1_FTSR1_FT8_Msk                          /*!< Falling trigger event configuration bit of line 8 */
#define EXTI1_FTSR1_FT9_Pos         (9U)
#define EXTI1_FTSR1_FT9_Msk         (0x1UL << EXTI1_FTSR1_FT9_Pos)                /*!< 0x00000200 */
#define EXTI1_FTSR1_FT9             EXTI1_FTSR1_FT9_Msk                          /*!< Falling trigger event configuration bit of line 9 */
#define EXTI1_FTSR1_FT10_Pos        (10U)
#define EXTI1_FTSR1_FT10_Msk        (0x1UL << EXTI1_FTSR1_FT10_Pos)               /*!< 0x00000400 */
#define EXTI1_FTSR1_FT10            EXTI1_FTSR1_FT10_Msk                         /*!< Falling trigger event configuration bit of line 10 */
#define EXTI1_FTSR1_FT11_Pos        (11U)
#define EXTI1_FTSR1_FT11_Msk        (0x1UL << EXTI1_FTSR1_FT11_Pos)               /*!< 0x00000800 */
#define EXTI1_FTSR1_FT11            EXTI1_FTSR1_FT11_Msk                         /*!< Falling trigger event configuration bit of line 11 */
#define EXTI1_FTSR1_FT12_Pos        (12U)
#define EXTI1_FTSR1_FT12_Msk        (0x1UL << EXTI1_FTSR1_FT12_Pos)               /*!< 0x00001000 */
#define EXTI1_FTSR1_FT12            EXTI1_FTSR1_FT12_Msk                         /*!< Falling trigger event configuration bit of line 12 */
#define EXTI1_FTSR1_FT13_Pos        (13U)
#define EXTI1_FTSR1_FT13_Msk        (0x1UL << EXTI1_FTSR1_FT13_Pos)               /*!< 0x00002000 */
#define EXTI1_FTSR1_FT13            EXTI1_FTSR1_FT13_Msk                         /*!< Falling trigger event configuration bit of line 13 */
#define EXTI1_FTSR1_FT14_Pos        (14U)
#define EXTI1_FTSR1_FT14_Msk        (0x1UL << EXTI1_FTSR1_FT14_Pos)               /*!< 0x00004000 */
#define EXTI1_FTSR1_FT14            EXTI1_FTSR1_FT14_Msk                         /*!< Falling trigger event configuration bit of line 14 */
#define EXTI1_FTSR1_FT15_Pos        (15U)
#define EXTI1_FTSR1_FT15_Msk        (0x1UL << EXTI1_FTSR1_FT15_Pos)               /*!< 0x00008000 */
#define EXTI1_FTSR1_FT15            EXTI1_FTSR1_FT15_Msk                         /*!< Falling trigger event configuration bit of line 15 */
#define EXTI1_FTSR1_FT16_Pos        (16U)
#define EXTI1_FTSR1_FT16_Msk        (0x1UL << EXTI1_FTSR1_FT16_Pos)               /*!< 0x00010000 */
#define EXTI1_FTSR1_FT16            EXTI1_FTSR1_FT16_Msk                         /*!< Falling trigger event configuration bit of line 16 */
#define EXTI1_FTSR1_FT17_Pos        (17U)
#define EXTI1_FTSR1_FT17_Msk        (0x1UL << EXTI1_FTSR1_FT17_Pos)               /*!< 0x00020000 */
#define EXTI1_FTSR1_FT17            EXTI1_FTSR1_FT17_Msk                         /*!< Falling trigger event configuration bit of line 17 */
#define EXTI1_FTSR1_FT18_Pos        (18U)
#define EXTI1_FTSR1_FT18_Msk        (0x1UL << EXTI1_FTSR1_FT18_Pos)               /*!< 0x00040000 */
#define EXTI1_FTSR1_FT18            EXTI1_FTSR1_FT18_Msk                         /*!< Falling trigger event configuration bit of line 18 */

