zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257cxx_cm0.h
/*****************  Bit definition for GPIO_SEMCR2 register  ******************/
#define GPIO_SEMCR2_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR2_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR2_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR2_SEM_MUTEX          GPIO_SEMCR2_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR2_SEMCID_Pos         (4U)
#define GPIO_SEMCR2_SEMCID_Msk         (0x3UL << GPIO_SEMCR2_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR2_SEMCID             GPIO_SEMCR2_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR3 register  *****************/
#define GPIO_CIDCFGR3_CFEN_Pos         (0U)
#define GPIO_CIDCFGR3_CFEN_Msk         (0x1UL << GPIO_CIDCFGR3_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR3_CFEN             GPIO_CIDCFGR3_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR3_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR3_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR3_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR3_SEM_EN           GPIO_CIDCFGR3_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR3_SCID_Pos         (4U)
#define GPIO_CIDCFGR3_SCID_Msk         (0x3UL << GPIO_CIDCFGR3_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR3_SCID             GPIO_CIDCFGR3_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR3_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR3_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR3_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR3_SEMWLC0          GPIO_CIDCFGR3_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR3_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR3_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR3_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR3_SEMWLC1          GPIO_CIDCFGR3_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR3_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR3_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR3_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR3_SEMWLC2          GPIO_CIDCFGR3_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR3_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR3_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR3_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR3_SEMWLC3          GPIO_CIDCFGR3_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR3 register  ******************/
#define GPIO_SEMCR3_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR3_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR3_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR3_SEM_MUTEX          GPIO_SEMCR3_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR3_SEMCID_Pos         (4U)
#define GPIO_SEMCR3_SEMCID_Msk         (0x3UL << GPIO_SEMCR3_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR3_SEMCID             GPIO_SEMCR3_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR4 register  *****************/
#define GPIO_CIDCFGR4_CFEN_Pos         (0U)
#define GPIO_CIDCFGR4_CFEN_Msk         (0x1UL << GPIO_CIDCFGR4_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR4_CFEN             GPIO_CIDCFGR4_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR4_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR4_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR4_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR4_SEM_EN           GPIO_CIDCFGR4_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR4_SCID_Pos         (4U)
#define GPIO_CIDCFGR4_SCID_Msk         (0x3UL << GPIO_CIDCFGR4_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR4_SCID             GPIO_CIDCFGR4_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR4_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR4_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR4_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR4_SEMWLC0          GPIO_CIDCFGR4_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR4_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR4_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR4_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR4_SEMWLC1          GPIO_CIDCFGR4_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR4_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR4_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR4_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR4_SEMWLC2          GPIO_CIDCFGR4_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR4_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR4_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR4_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR4_SEMWLC3          GPIO_CIDCFGR4_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR4 register  ******************/
#define GPIO_SEMCR4_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR4_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR4_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR4_SEM_MUTEX          GPIO_SEMCR4_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR4_SEMCID_Pos         (4U)
#define GPIO_SEMCR4_SEMCID_Msk         (0x3UL << GPIO_SEMCR4_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR4_SEMCID             GPIO_SEMCR4_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR5 register  *****************/
#define GPIO_CIDCFGR5_CFEN_Pos         (0U)
#define GPIO_CIDCFGR5_CFEN_Msk         (0x1UL << GPIO_CIDCFGR5_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR5_CFEN             GPIO_CIDCFGR5_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR5_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR5_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR5_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR5_SEM_EN           GPIO_CIDCFGR5_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR5_SCID_Pos         (4U)
#define GPIO_CIDCFGR5_SCID_Msk         (0x3UL << GPIO_CIDCFGR5_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR5_SCID             GPIO_CIDCFGR5_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR5_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR5_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR5_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR5_SEMWLC0          GPIO_CIDCFGR5_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR5_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR5_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR5_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR5_SEMWLC1          GPIO_CIDCFGR5_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR5_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR5_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR5_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR5_SEMWLC2          GPIO_CIDCFGR5_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR5_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR5_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR5_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR5_SEMWLC3          GPIO_CIDCFGR5_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR5 register  ******************/
#define GPIO_SEMCR5_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR5_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR5_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR5_SEM_MUTEX          GPIO_SEMCR5_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR5_SEMCID_Pos         (4U)
#define GPIO_SEMCR5_SEMCID_Msk         (0x3UL << GPIO_SEMCR5_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR5_SEMCID             GPIO_SEMCR5_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR6 register  *****************/
#define GPIO_CIDCFGR6_CFEN_Pos         (0U)
#define GPIO_CIDCFGR6_CFEN_Msk         (0x1UL << GPIO_CIDCFGR6_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR6_CFEN             GPIO_CIDCFGR6_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR6_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR6_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR6_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR6_SEM_EN           GPIO_CIDCFGR6_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR6_SCID_Pos         (4U)
#define GPIO_CIDCFGR6_SCID_Msk         (0x3UL << GPIO_CIDCFGR6_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR6_SCID             GPIO_CIDCFGR6_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR6_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR6_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR6_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR6_SEMWLC0          GPIO_CIDCFGR6_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR6_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR6_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR6_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR6_SEMWLC1          GPIO_CIDCFGR6_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR6_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR6_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR6_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR6_SEMWLC2          GPIO_CIDCFGR6_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR6_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR6_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR6_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR6_SEMWLC3          GPIO_CIDCFGR6_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

