zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257cxx_cm0.h
/****************  Bit definition for GPIO_CIDCFGR13 register  ****************/
#define GPIO_CIDCFGR13_CFEN_Pos        (0U)
#define GPIO_CIDCFGR13_CFEN_Msk        (0x1UL << GPIO_CIDCFGR13_CFEN_Pos)        /*!< 0x00000001 */
#define GPIO_CIDCFGR13_CFEN            GPIO_CIDCFGR13_CFEN_Msk                  /*!< CID filtering enable */
#define GPIO_CIDCFGR13_SEM_EN_Pos      (1U)
#define GPIO_CIDCFGR13_SEM_EN_Msk      (0x1UL << GPIO_CIDCFGR13_SEM_EN_Pos)      /*!< 0x00000002 */
#define GPIO_CIDCFGR13_SEM_EN          GPIO_CIDCFGR13_SEM_EN_Msk                /*!< Semaphore enable */
#define GPIO_CIDCFGR13_SCID_Pos        (4U)
#define GPIO_CIDCFGR13_SCID_Msk        (0x3UL << GPIO_CIDCFGR13_SCID_Pos)        /*!< 0x00000030 */
#define GPIO_CIDCFGR13_SCID            GPIO_CIDCFGR13_SCID_Msk                  /*!< Static CID */
#define GPIO_CIDCFGR13_SEMWLC0_Pos     (16U)
#define GPIO_CIDCFGR13_SEMWLC0_Msk     (0x1UL << GPIO_CIDCFGR13_SEMWLC0_Pos)     /*!< 0x00010000 */
#define GPIO_CIDCFGR13_SEMWLC0         GPIO_CIDCFGR13_SEMWLC0_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR13_SEMWLC1_Pos     (17U)
#define GPIO_CIDCFGR13_SEMWLC1_Msk     (0x1UL << GPIO_CIDCFGR13_SEMWLC1_Pos)     /*!< 0x00020000 */
#define GPIO_CIDCFGR13_SEMWLC1         GPIO_CIDCFGR13_SEMWLC1_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR13_SEMWLC2_Pos     (18U)
#define GPIO_CIDCFGR13_SEMWLC2_Msk     (0x1UL << GPIO_CIDCFGR13_SEMWLC2_Pos)     /*!< 0x00040000 */
#define GPIO_CIDCFGR13_SEMWLC2         GPIO_CIDCFGR13_SEMWLC2_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR13_SEMWLC3_Pos     (19U)
#define GPIO_CIDCFGR13_SEMWLC3_Msk     (0x1UL << GPIO_CIDCFGR13_SEMWLC3_Pos)     /*!< 0x00080000 */
#define GPIO_CIDCFGR13_SEMWLC3         GPIO_CIDCFGR13_SEMWLC3_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR13 register  *****************/
#define GPIO_SEMCR13_SEM_MUTEX_Pos     (0U)
#define GPIO_SEMCR13_SEM_MUTEX_Msk     (0x1UL << GPIO_SEMCR13_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define GPIO_SEMCR13_SEM_MUTEX         GPIO_SEMCR13_SEM_MUTEX_Msk               /*!< Semaphore Mutex */
#define GPIO_SEMCR13_SEMCID_Pos        (4U)
#define GPIO_SEMCR13_SEMCID_Msk        (0x3UL << GPIO_SEMCR13_SEMCID_Pos)        /*!< 0x00000030 */
#define GPIO_SEMCR13_SEMCID            GPIO_SEMCR13_SEMCID_Msk                  /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR14 register  ****************/
#define GPIO_CIDCFGR14_CFEN_Pos        (0U)
#define GPIO_CIDCFGR14_CFEN_Msk        (0x1UL << GPIO_CIDCFGR14_CFEN_Pos)        /*!< 0x00000001 */
#define GPIO_CIDCFGR14_CFEN            GPIO_CIDCFGR14_CFEN_Msk                  /*!< CID filtering enable */
#define GPIO_CIDCFGR14_SEM_EN_Pos      (1U)
#define GPIO_CIDCFGR14_SEM_EN_Msk      (0x1UL << GPIO_CIDCFGR14_SEM_EN_Pos)      /*!< 0x00000002 */
#define GPIO_CIDCFGR14_SEM_EN          GPIO_CIDCFGR14_SEM_EN_Msk                /*!< Semaphore enable */
#define GPIO_CIDCFGR14_SCID_Pos        (4U)
#define GPIO_CIDCFGR14_SCID_Msk        (0x3UL << GPIO_CIDCFGR14_SCID_Pos)        /*!< 0x00000030 */
#define GPIO_CIDCFGR14_SCID            GPIO_CIDCFGR14_SCID_Msk                  /*!< Static CID */
#define GPIO_CIDCFGR14_SEMWLC0_Pos     (16U)
#define GPIO_CIDCFGR14_SEMWLC0_Msk     (0x1UL << GPIO_CIDCFGR14_SEMWLC0_Pos)     /*!< 0x00010000 */
#define GPIO_CIDCFGR14_SEMWLC0         GPIO_CIDCFGR14_SEMWLC0_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR14_SEMWLC1_Pos     (17U)
#define GPIO_CIDCFGR14_SEMWLC1_Msk     (0x1UL << GPIO_CIDCFGR14_SEMWLC1_Pos)     /*!< 0x00020000 */
#define GPIO_CIDCFGR14_SEMWLC1         GPIO_CIDCFGR14_SEMWLC1_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR14_SEMWLC2_Pos     (18U)
#define GPIO_CIDCFGR14_SEMWLC2_Msk     (0x1UL << GPIO_CIDCFGR14_SEMWLC2_Pos)     /*!< 0x00040000 */
#define GPIO_CIDCFGR14_SEMWLC2         GPIO_CIDCFGR14_SEMWLC2_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR14_SEMWLC3_Pos     (19U)
#define GPIO_CIDCFGR14_SEMWLC3_Msk     (0x1UL << GPIO_CIDCFGR14_SEMWLC3_Pos)     /*!< 0x00080000 */
#define GPIO_CIDCFGR14_SEMWLC3         GPIO_CIDCFGR14_SEMWLC3_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR14 register  *****************/
#define GPIO_SEMCR14_SEM_MUTEX_Pos     (0U)
#define GPIO_SEMCR14_SEM_MUTEX_Msk     (0x1UL << GPIO_SEMCR14_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define GPIO_SEMCR14_SEM_MUTEX         GPIO_SEMCR14_SEM_MUTEX_Msk               /*!< Semaphore Mutex */
#define GPIO_SEMCR14_SEMCID_Pos        (4U)
#define GPIO_SEMCR14_SEMCID_Msk        (0x3UL << GPIO_SEMCR14_SEMCID_Pos)        /*!< 0x00000030 */
#define GPIO_SEMCR14_SEMCID            GPIO_SEMCR14_SEMCID_Msk                  /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR15 register  ****************/
#define GPIO_CIDCFGR15_CFEN_Pos        (0U)
#define GPIO_CIDCFGR15_CFEN_Msk        (0x1UL << GPIO_CIDCFGR15_CFEN_Pos)        /*!< 0x00000001 */
#define GPIO_CIDCFGR15_CFEN            GPIO_CIDCFGR15_CFEN_Msk                  /*!< CID filtering enable */
#define GPIO_CIDCFGR15_SEM_EN_Pos      (1U)
#define GPIO_CIDCFGR15_SEM_EN_Msk      (0x1UL << GPIO_CIDCFGR15_SEM_EN_Pos)      /*!< 0x00000002 */
#define GPIO_CIDCFGR15_SEM_EN          GPIO_CIDCFGR15_SEM_EN_Msk                /*!< Semaphore enable */
#define GPIO_CIDCFGR15_SCID_Pos        (4U)
#define GPIO_CIDCFGR15_SCID_Msk        (0x3UL << GPIO_CIDCFGR15_SCID_Pos)        /*!< 0x00000030 */
#define GPIO_CIDCFGR15_SCID            GPIO_CIDCFGR15_SCID_Msk                  /*!< Static CID */
#define GPIO_CIDCFGR15_SEMWLC0_Pos     (16U)
#define GPIO_CIDCFGR15_SEMWLC0_Msk     (0x1UL << GPIO_CIDCFGR15_SEMWLC0_Pos)     /*!< 0x00010000 */
#define GPIO_CIDCFGR15_SEMWLC0         GPIO_CIDCFGR15_SEMWLC0_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR15_SEMWLC1_Pos     (17U)
#define GPIO_CIDCFGR15_SEMWLC1_Msk     (0x1UL << GPIO_CIDCFGR15_SEMWLC1_Pos)     /*!< 0x00020000 */
#define GPIO_CIDCFGR15_SEMWLC1         GPIO_CIDCFGR15_SEMWLC1_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR15_SEMWLC2_Pos     (18U)
#define GPIO_CIDCFGR15_SEMWLC2_Msk     (0x1UL << GPIO_CIDCFGR15_SEMWLC2_Pos)     /*!< 0x00040000 */
#define GPIO_CIDCFGR15_SEMWLC2         GPIO_CIDCFGR15_SEMWLC2_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR15_SEMWLC3_Pos     (19U)
#define GPIO_CIDCFGR15_SEMWLC3_Msk     (0x1UL << GPIO_CIDCFGR15_SEMWLC3_Pos)     /*!< 0x00080000 */
#define GPIO_CIDCFGR15_SEMWLC3         GPIO_CIDCFGR15_SEMWLC3_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR15 register  *****************/
#define GPIO_SEMCR15_SEM_MUTEX_Pos     (0U)
#define GPIO_SEMCR15_SEM_MUTEX_Msk     (0x1UL << GPIO_SEMCR15_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define GPIO_SEMCR15_SEM_MUTEX         GPIO_SEMCR15_SEM_MUTEX_Msk               /*!< Semaphore Mutex */
#define GPIO_SEMCR15_SEMCID_Pos        (4U)
#define GPIO_SEMCR15_SEMCID_Msk        (0x3UL << GPIO_SEMCR15_SEMCID_Pos)        /*!< 0x00000030 */
#define GPIO_SEMCR15_SEMCID            GPIO_SEMCR15_SEMCID_Msk                  /*!< Semaphore current CID */

/****************  Bit definition for GPIO_HWCFGR10 register  *****************/
#define GPIO_HWCFGR10_AHB_IOP_Pos      (0U)
#define GPIO_HWCFGR10_AHB_IOP_Msk      (0xFUL << GPIO_HWCFGR10_AHB_IOP_Pos)      /*!< 0x0000000F */
#define GPIO_HWCFGR10_AHB_IOP          GPIO_HWCFGR10_AHB_IOP_Msk                /*!< Bus interface configuration */
#define GPIO_HWCFGR10_AFSIZE_CFG_Pos   (4U)
#define GPIO_HWCFGR10_AFSIZE_CFG_Msk   (0xFUL << GPIO_HWCFGR10_AFSIZE_CFG_Pos)   /*!< 0x000000F0 */
#define GPIO_HWCFGR10_AFSIZE_CFG       GPIO_HWCFGR10_AFSIZE_CFG_Msk             /*!< Number of AF available for each I/O */
#define GPIO_HWCFGR10_SPEED_CFG_Pos    (8U)
#define GPIO_HWCFGR10_SPEED_CFG_Msk    (0xFUL << GPIO_HWCFGR10_SPEED_CFG_Pos)    /*!< 0x00000F00 */
#define GPIO_HWCFGR10_SPEED_CFG        GPIO_HWCFGR10_SPEED_CFG_Msk              /*!< Number of speed lines for each I/O */
#define GPIO_HWCFGR10_LOCK_CFG_Pos     (12U)
#define GPIO_HWCFGR10_LOCK_CFG_Msk     (0xFUL << GPIO_HWCFGR10_LOCK_CFG_Pos)     /*!< 0x0000F000 */
#define GPIO_HWCFGR10_LOCK_CFG         GPIO_HWCFGR10_LOCK_CFG_Msk               /*!< Lock mechanism activation */
#define GPIO_HWCFGR10_SEC_CFG_Pos      (16U)
#define GPIO_HWCFGR10_SEC_CFG_Msk      (0xFUL << GPIO_HWCFGR10_SEC_CFG_Pos)      /*!< 0x000F0000 */
#define GPIO_HWCFGR10_SEC_CFG          GPIO_HWCFGR10_SEC_CFG_Msk                /*!< Security activation */
#define GPIO_HWCFGR10_OR_CFG_Pos       (20U)
#define GPIO_HWCFGR10_OR_CFG_Msk       (0xFUL << GPIO_HWCFGR10_OR_CFG_Pos)       /*!< 0x00F00000 */
#define GPIO_HWCFGR10_OR_CFG           GPIO_HWCFGR10_OR_CFG_Msk                 /*!< Option register configuration */

/*****************  Bit definition for GPIO_HWCFGR9 register  *****************/
#define GPIO_HWCFGR9_EN_IO_Pos         (0U)
#define GPIO_HWCFGR9_EN_IO_Msk         (0xFFFFUL << GPIO_HWCFGR9_EN_IO_Pos)      /*!< 0x0000FFFF */
#define GPIO_HWCFGR9_EN_IO             GPIO_HWCFGR9_EN_IO_Msk                   /*!< Presence granularity, each bit indicate the presence of the IO */

/*****************  Bit definition for GPIO_HWCFGR8 register  *****************/
#define GPIO_HWCFGR8_AF_PRIO8_Pos      (0U)
#define GPIO_HWCFGR8_AF_PRIO8_Msk      (0xFUL << GPIO_HWCFGR8_AF_PRIO8_Pos)      /*!< 0x0000000F */
#define GPIO_HWCFGR8_AF_PRIO8          GPIO_HWCFGR8_AF_PRIO8_Msk                /*!< Indicate the priority AF for I/O8 (0 to F) */
#define GPIO_HWCFGR8_AF_PRIO9_Pos      (4U)
#define GPIO_HWCFGR8_AF_PRIO9_Msk      (0xFUL << GPIO_HWCFGR8_AF_PRIO9_Pos)      /*!< 0x000000F0 */
#define GPIO_HWCFGR8_AF_PRIO9          GPIO_HWCFGR8_AF_PRIO9_Msk                /*!< Indicate the priority AF for I/O9 (0 to F) */
#define GPIO_HWCFGR8_AF_PRIO10_Pos     (8U)
#define GPIO_HWCFGR8_AF_PRIO10_Msk     (0xFUL << GPIO_HWCFGR8_AF_PRIO10_Pos)     /*!< 0x00000F00 */
#define GPIO_HWCFGR8_AF_PRIO10         GPIO_HWCFGR8_AF_PRIO10_Msk               /*!< Indicate the priority AF for I/O10 (0 to F) */
#define GPIO_HWCFGR8_AF_PRIO11_Pos     (12U)
#define GPIO_HWCFGR8_AF_PRIO11_Msk     (0xFUL << GPIO_HWCFGR8_AF_PRIO11_Pos)     /*!< 0x0000F000 */
#define GPIO_HWCFGR8_AF_PRIO11         GPIO_HWCFGR8_AF_PRIO11_Msk               /*!< Indicate the priority AF for I/O11 (0 to F) */
#define GPIO_HWCFGR8_AF_PRIO12_Pos     (16U)
#define GPIO_HWCFGR8_AF_PRIO12_Msk     (0xFUL << GPIO_HWCFGR8_AF_PRIO12_Pos)     /*!< 0x000F0000 */
#define GPIO_HWCFGR8_AF_PRIO12         GPIO_HWCFGR8_AF_PRIO12_Msk               /*!< Indicate the priority AF for I/O12 (0 to F) */
#define GPIO_HWCFGR8_AF_PRIO13_Pos     (20U)
#define GPIO_HWCFGR8_AF_PRIO13_Msk     (0xFUL << GPIO_HWCFGR8_AF_PRIO13_Pos)     /*!< 0x00F00000 */
#define GPIO_HWCFGR8_AF_PRIO13         GPIO_HWCFGR8_AF_PRIO13_Msk               /*!< Indicate the priority AF for I/O13 (0 to F) */
#define GPIO_HWCFGR8_AF_PRIO14_Pos     (24U)
#define GPIO_HWCFGR8_AF_PRIO14_Msk     (0xFUL << GPIO_HWCFGR8_AF_PRIO14_Pos)     /*!< 0x0F000000 */
#define GPIO_HWCFGR8_AF_PRIO14         GPIO_HWCFGR8_AF_PRIO14_Msk               /*!< Indicate the priority AF for I/O14 (0 to F) */
#define GPIO_HWCFGR8_AF_PRIO15_Pos     (28U)
#define GPIO_HWCFGR8_AF_PRIO15_Msk     (0xFUL << GPIO_HWCFGR8_AF_PRIO15_Pos)     /*!< 0xF0000000 */
#define GPIO_HWCFGR8_AF_PRIO15         GPIO_HWCFGR8_AF_PRIO15_Msk               /*!< Indicate the priority AF for I/O15 (0 to F) */

