zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257cxx_cm0.h
/******************  Bit definition for I3C_DEVR0 register  *******************/
#define I3C_DEVR0_DAVAL_Pos          (0U)
#define I3C_DEVR0_DAVAL_Msk          (0x1UL << I3C_DEVR0_DAVAL_Pos)         /*!< 0x00000001 */
#define I3C_DEVR0_DAVAL              I3C_DEVR0_DAVAL_Msk                   /*!< dynamic address is valid (when the I3C is acting as target) */
#define I3C_DEVR0_DA_Pos             (1U)
#define I3C_DEVR0_DA_Msk             (0x7FUL << I3C_DEVR0_DA_Pos)           /*!< 0x000000FE */
#define I3C_DEVR0_DA                 I3C_DEVR0_DA_Msk                      /*!< 7-bit dynamic address */
#define I3C_DEVR0_IBIEN_Pos          (16U)
#define I3C_DEVR0_IBIEN_Msk          (0x1UL << I3C_DEVR0_IBIEN_Pos)         /*!< 0x00010000 */
#define I3C_DEVR0_IBIEN              I3C_DEVR0_IBIEN_Msk                   /*!< IBI request enable (when the I3C is acting as target) */
#define I3C_DEVR0_CREN_Pos           (17U)
#define I3C_DEVR0_CREN_Msk           (0x1UL << I3C_DEVR0_CREN_Pos)          /*!< 0x00020000 */
#define I3C_DEVR0_CREN               I3C_DEVR0_CREN_Msk                    /*!< controller-role request enable (when the I3C is acting as target) */
#define I3C_DEVR0_HJEN_Pos           (19U)
#define I3C_DEVR0_HJEN_Msk           (0x1UL << I3C_DEVR0_HJEN_Pos)          /*!< 0x00080000 */
#define I3C_DEVR0_HJEN               I3C_DEVR0_HJEN_Msk                    /*!< hot-join request enable (when the I3C is acting as target) */
#define I3C_DEVR0_AS_Pos             (20U)
#define I3C_DEVR0_AS_Msk             (0x3UL << I3C_DEVR0_AS_Pos)            /*!< 0x00300000 */
#define I3C_DEVR0_AS                 I3C_DEVR0_AS_Msk                      /*!< activity state (when the I3C is acting as target) */
#define I3C_DEVR0_AS_0               (0x1UL << I3C_DEVR0_AS_Pos)           /*!< 0x00100000 */
#define I3C_DEVR0_AS_1               (0x2UL << I3C_DEVR0_AS_Pos)           /*!< 0x00200000 */
#define I3C_DEVR0_RSTACT_Pos         (22U)
#define I3C_DEVR0_RSTACT_Msk         (0x3UL << I3C_DEVR0_RSTACT_Pos)        /*!< 0x00C00000 */
#define I3C_DEVR0_RSTACT             I3C_DEVR0_RSTACT_Msk                  /*!< reset action/level on received reset pattern (when the I3C is acting as target) */
#define I3C_DEVR0_RSTACT_0           (0x1UL << I3C_DEVR0_RSTACT_Pos)       /*!< 0x00400000 */
#define I3C_DEVR0_RSTACT_1           (0x2UL << I3C_DEVR0_RSTACT_Pos)       /*!< 0x00800000 */
#define I3C_DEVR0_RSTVAL_Pos         (24U)
#define I3C_DEVR0_RSTVAL_Msk         (0x1UL << I3C_DEVR0_RSTVAL_Pos)        /*!< 0x01000000 */
#define I3C_DEVR0_RSTVAL             I3C_DEVR0_RSTVAL_Msk                  /*!< reset action is valid (when the I3C is acting as target) */

/******************  Bit definition for I3C_DEVRX register  *******************/
#define I3C_DEVRX_DA_Pos             (1U)
#define I3C_DEVRX_DA_Msk             (0x7FUL << I3C_DEVRX_DA_Pos)           /*!< 0x000000FE */
#define I3C_DEVRX_DA                 I3C_DEVRX_DA_Msk                      /*!< assigned I3C dynamic address to target x (when the I3C is acting as controller) */
#define I3C_DEVRX_IBIACK_Pos         (16U)
#define I3C_DEVRX_IBIACK_Msk         (0x1UL << I3C_DEVRX_IBIACK_Pos)        /*!< 0x00010000 */
#define I3C_DEVRX_IBIACK             I3C_DEVRX_IBIACK_Msk                  /*!< IBI request acknowledge (when the I3C is acting as controller) */
#define I3C_DEVRX_CRACK_Pos          (17U)
#define I3C_DEVRX_CRACK_Msk          (0x1UL << I3C_DEVRX_CRACK_Pos)         /*!< 0x00020000 */
#define I3C_DEVRX_CRACK              I3C_DEVRX_CRACK_Msk                   /*!< controller-role request acknowledge (when the I3C is acting as controller) */
#define I3C_DEVRX_IBIDEN_Pos         (18U)
#define I3C_DEVRX_IBIDEN_Msk         (0x1UL << I3C_DEVRX_IBIDEN_Pos)        /*!< 0x00040000 */
#define I3C_DEVRX_IBIDEN             I3C_DEVRX_IBIDEN_Msk                  /*!< IBI data enable (when the I3C is acting as controller) */
#define I3C_DEVRX_SUSP_Pos           (19U)
#define I3C_DEVRX_SUSP_Msk           (0x1UL << I3C_DEVRX_SUSP_Pos)          /*!< 0x00080000 */
#define I3C_DEVRX_SUSP               I3C_DEVRX_SUSP_Msk                    /*!< suspend/stop I3C transfer on received IBI (when the I3C is acting as controller) */
#define I3C_DEVRX_DIS_Pos            (31U)
#define I3C_DEVRX_DIS_Msk            (0x1UL << I3C_DEVRX_DIS_Pos)           /*!< 0x80000000 */
#define I3C_DEVRX_DIS                I3C_DEVRX_DIS_Msk                     /*!< DA[6:0] write disabled (when the I3C is acting as controller) */

/******************  Bit definition for I3C_MAXRLR register  ******************/
#define I3C_MAXRLR_MRL_Pos           (0U)
#define I3C_MAXRLR_MRL_Msk           (0xFFFFUL << I3C_MAXRLR_MRL_Pos)       /*!< 0x0000FFFF */
#define I3C_MAXRLR_MRL               I3C_MAXRLR_MRL_Msk                    /*!< maximum data read length (when I3C is acting as target) */
#define I3C_MAXRLR_IBIP_Pos          (16U)
#define I3C_MAXRLR_IBIP_Msk          (0x7UL << I3C_MAXRLR_IBIP_Pos)         /*!< 0x00070000 */
#define I3C_MAXRLR_IBIP              I3C_MAXRLR_IBIP_Msk                   /*!< IBI payload data size, in bytes (when I3C is acting as target) */
#define I3C_MAXRLR_IBIP_0            (0x1UL << I3C_MAXRLR_IBIP_Pos)        /*!< 0x00010000 */
#define I3C_MAXRLR_IBIP_1            (0x2UL << I3C_MAXRLR_IBIP_Pos)        /*!< 0x00020000 */
#define I3C_MAXRLR_IBIP_2            (0x4UL << I3C_MAXRLR_IBIP_Pos)        /*!< 0x00040000 */

/******************  Bit definition for I3C_MAXWLR register  ******************/
#define I3C_MAXWLR_MWL_Pos           (0U)
#define I3C_MAXWLR_MWL_Msk           (0xFFFFUL << I3C_MAXWLR_MWL_Pos)       /*!< 0x0000FFFF */
#define I3C_MAXWLR_MWL               I3C_MAXWLR_MWL_Msk                    /*!< maximum data write length (when I3C is acting as target) */

/*****************  Bit definition for I3C_TIMINGR0 register  *****************/
#define I3C_TIMINGR0_SCLL_PP_Pos     (0U)
#define I3C_TIMINGR0_SCLL_PP_Msk     (0xFFUL << I3C_TIMINGR0_SCLL_PP_Pos)   /*!< 0x000000FF */
#define I3C_TIMINGR0_SCLL_PP         I3C_TIMINGR0_SCLL_PP_Msk              /*!< SCL low duration in I3C push-pull phases, in number of kernel clocks cycles: */
#define I3C_TIMINGR0_SCLH_I3C_Pos    (8U)
#define I3C_TIMINGR0_SCLH_I3C_Msk    (0xFFUL << I3C_TIMINGR0_SCLH_I3C_Pos)  /*!< 0x0000FF00 */
#define I3C_TIMINGR0_SCLH_I3C        I3C_TIMINGR0_SCLH_I3C_Msk             /*!< SCL high duration, used for I3C messages (both in push-pull and open-drain phases), in number of ke */
#define I3C_TIMINGR0_SCLL_OD_Pos     (16U)
#define I3C_TIMINGR0_SCLL_OD_Msk     (0xFFUL << I3C_TIMINGR0_SCLL_OD_Pos)   /*!< 0x00FF0000 */
#define I3C_TIMINGR0_SCLL_OD         I3C_TIMINGR0_SCLL_OD_Msk              /*!< SCL low duration in open-drain phases, used for legacy I2C commands and for I3C open-drain phases ( */
#define I3C_TIMINGR0_SCLH_I2C_Pos    (24U)
#define I3C_TIMINGR0_SCLH_I2C_Msk    (0xFFUL << I3C_TIMINGR0_SCLH_I2C_Pos)  /*!< 0xFF000000 */
#define I3C_TIMINGR0_SCLH_I2C        I3C_TIMINGR0_SCLH_I2C_Msk             /*!< SCL high duration, used for legacy I2C commands, in number of kernel clocks cycles: */

/*****************  Bit definition for I3C_TIMINGR1 register  *****************/
#define I3C_TIMINGR1_AVAL_Pos        (0U)
#define I3C_TIMINGR1_AVAL_Msk        (0xFFUL << I3C_TIMINGR1_AVAL_Pos)      /*!< 0x000000FF */
#define I3C_TIMINGR1_AVAL            I3C_TIMINGR1_AVAL_Msk                 /*!< number of kernel clock cycles, that is used whatever I3C is acting as controller or target, to set  */
#define I3C_TIMINGR1_ASNCR_Pos       (8U)
#define I3C_TIMINGR1_ASNCR_Msk       (0x3UL << I3C_TIMINGR1_ASNCR_Pos)      /*!< 0x00000300 */
#define I3C_TIMINGR1_ASNCR           I3C_TIMINGR1_ASNCR_Msk                /*!< activity state of the new controller (when I3C is acting as - active- controller) */
#define I3C_TIMINGR1_ASNCR_0         (0x1UL << I3C_TIMINGR1_ASNCR_Pos)     /*!< 0x00000100 */
#define I3C_TIMINGR1_ASNCR_1         (0x2UL << I3C_TIMINGR1_ASNCR_Pos)     /*!< 0x00000200 */
#define I3C_TIMINGR1_FREE_Pos        (16U)
#define I3C_TIMINGR1_FREE_Msk        (0x7FUL << I3C_TIMINGR1_FREE_Pos)      /*!< 0x007F0000 */
#define I3C_TIMINGR1_FREE            I3C_TIMINGR1_FREE_Msk                 /*!< number of kernel clocks cycles that is used to set some MIPI timings like bus free condition time ( */
#define I3C_TIMINGR1_SDA_HD_Pos      (28U)
#define I3C_TIMINGR1_SDA_HD_Msk      (0x1UL << I3C_TIMINGR1_SDA_HD_Pos)     /*!< 0x10000000 */
#define I3C_TIMINGR1_SDA_HD          I3C_TIMINGR1_SDA_HD_Msk               /*!< SDA hold time (when the I3C is acting as controller), in number of kernel clocks cycles (refer to M */

/*****************  Bit definition for I3C_TIMINGR2 register  *****************/
#define I3C_TIMINGR2_STALLT_Pos      (0U)
#define I3C_TIMINGR2_STALLT_Msk      (0x1UL << I3C_TIMINGR2_STALLT_Pos)     /*!< 0x00000001 */
#define I3C_TIMINGR2_STALLT          I3C_TIMINGR2_STALLT_Msk               /*!< Controller clock stall on T-bit phase of Data enable */
#define I3C_TIMINGR2_STALLD_Pos      (1U)
#define I3C_TIMINGR2_STALLD_Msk      (0x1UL << I3C_TIMINGR2_STALLD_Pos)     /*!< 0x00000002 */
#define I3C_TIMINGR2_STALLD          I3C_TIMINGR2_STALLD_Msk               /*!< controller clock stall on PAR phase of Data enable */
#define I3C_TIMINGR2_STALLC_Pos      (2U)
#define I3C_TIMINGR2_STALLC_Msk      (0x1UL << I3C_TIMINGR2_STALLC_Pos)     /*!< 0x00000004 */
#define I3C_TIMINGR2_STALLC          I3C_TIMINGR2_STALLC_Msk               /*!< controller clock stall on PAR phase of CCC enable */
#define I3C_TIMINGR2_STALLA_Pos      (3U)
#define I3C_TIMINGR2_STALLA_Msk      (0x1UL << I3C_TIMINGR2_STALLA_Pos)     /*!< 0x00000008 */
#define I3C_TIMINGR2_STALLA          I3C_TIMINGR2_STALLA_Msk               /*!< controller clock stall enable on ACK phase */
#define I3C_TIMINGR2_STALL_Pos       (8U)
#define I3C_TIMINGR2_STALL_Msk       (0xFFUL << I3C_TIMINGR2_STALL_Pos)     /*!< 0x0000FF00 */
#define I3C_TIMINGR2_STALL           I3C_TIMINGR2_STALL_Msk                /*!< controller clock stall time, in number of kernel clock cycles */

/*******************  Bit definition for I3C_BCR register  ********************/
#define I3C_BCR_BCR_Pos              (0U)
#define I3C_BCR_BCR_Msk              (0xFFUL << I3C_BCR_BCR_Pos)           /*!< 0x000000FF */
#define I3C_BCR_BCR                  I3C_BCR_BCR_Msk                       /*!< Bus Characteristics */
#define I3C_BCR_BCR0_Pos             (0U)
#define I3C_BCR_BCR0_Msk             (0x1UL << I3C_BCR_BCR0_Pos)           /*!< 0x00000001 */
#define I3C_BCR_BCR0                 I3C_BCR_BCR0_Msk                      /*!< Max Data Speed Limitation */
#define I3C_BCR_BCR1_Pos             (1U)
#define I3C_BCR_BCR1_Msk             (0x1UL << I3C_BCR_BCR1_Pos)           /*!< 0x00000002 */
#define I3C_BCR_BCR1                 I3C_BCR_BCR1_Msk                      /*!< IBI Request capable */
#define I3C_BCR_BCR2_Pos             (2U)
#define I3C_BCR_BCR2_Msk             (0x1UL << I3C_BCR_BCR2_Pos)           /*!< 0x00000004 */
#define I3C_BCR_BCR2                 I3C_BCR_BCR2_Msk                      /*!< IBI Payload additional Mandatory Data Byte */
#define I3C_BCR_BCR6_Pos             (6U)
#define I3C_BCR_BCR6_Msk             (0x1UL << I3C_BCR_BCR6_Pos)           /*!< 0x00000040 */
#define I3C_BCR_BCR6                 I3C_BCR_BCR6_Msk                      /*!< Device Role shared during Dynamic Address Assignment */

